package com.example.clonetrello

object HardCodeInfo {
    val listModelCardDate = arrayListOf(
        ModelCardDate("29/07/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("30/07/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("01/08/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("02/08/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("03/08/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("04/08/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("05/08/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("19/08/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
        ModelCardDate("20/08/21", arrayListOf(
            ModelTask("Собрать совещание", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Поговорить с представителем бодрящиков", "Поговорить с Юрием Измайловым на счёт будущего", "Жуликова С.В.", arrayListOf(), "29/07/21", false),
            ModelTask("Проверить качество работы", "Добраться до ул. Мира 5 и посмотреть на качество укладки асфальта. Поговорить с бодрящиком на счет дороги на Пушкино.", "Иванова А.В", arrayListOf(), "29/07/21", false),
            ModelTask("Собрать совещяние", "Собрать совещание в здании администрации для решения зимних вопросов", "Иванова А.В", arrayListOf(), "29/07/21", true),
        )),
    )
}